Config/Catalogs/ПериодыМСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПериодыМСД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьМСД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрыватьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПериодыМСД/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий  

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Или ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Родитель) И НЕ Ссылка.Пустая() Тогда
		// Возможно изменение реквизита "Произвольный"
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Периоды.Ссылка
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды.Родитель = &Родитель");
		Запрос.УстановитьПараметр("Родитель", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаСсылка = Выборка.Ссылка;			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Попытка
				Объект.Заблокировать();  
			Исключение
				Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(НСтр("ru = 'ПередЗаписьюПериодаМСД'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение,, Объект, Текст);
				ОбщегоНазначения.СообщитьПользователю(Текст, Выборка.Ссылка,,, Отказ);
				Возврат;
			КонецПопытки;

			Объект.Произвольный = Произвольный;
			
			Если Объект.Произвольный = ВыборкаСсылка.Произвольный Тогда
				Объект.Разблокировать();
				Продолжить;
			КонецЕсли;
			
			Попытка
				Объект.Записать();
			Исключение
				Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(НСтр("ru = 'ПередЗаписьюПериодаМСД'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение,, Объект, Текст);
				ОбщегоНазначения.СообщитьПользователю(Текст, Выборка.Ссылка,,, Отказ);
				Возврат;
			КонецПопытки; 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Произвольный Тогда
		ПроверяемыеРеквизиты.Вставить(0, "Периодичность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Если ДатаНачала < Родитель.ДатаНачала Тогда 
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата начала периода меньше даты начала родительского периода'"), , "ДатаНачала", "Объект", Отказ); 
		КонецЕсли;	
		Если ДатаОкончания > Родитель.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата окончания периода больше даты окончания родительского периода'"), , "ДатаОкончания", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
